{"id":"wildchat_7","text":"True or false?: Transformers features pairwise attention of all pairwise combinations of tokens in the input token context window?","type":"knowledge_recall","topic":"ai"}
{"id":"wildchat_19","text":"A man holds part of a balloon's string on the ground and puts a motorcycle helmet on top of that segment of the string, but doesn't tie the string to the helmet. What likely happens after the man releases his hold on the string? You may ask for clarifications instead of answering yet. If you answer, rate your confidence in your answer as low, medium, or high.","type":"problem_solving","topic":"physics"}
{"id":"wildchat_46","text":"Give me a body email for sending a resume","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_61","text":"write me an passage within 150 words on why economic success should never come at the cost of damage to the environment","type":"creative","topic":"philosophy"}
{"id":"wildchat_80","text":"Write a screenplay about the status of ChatGPT.","type":"creative","topic":"technology_other"}
{"id":"wildchat_83","text":"give me a response to ```I've been doing well. I've been taking time to appreciate the small moments and finding ways to stay grounded amidst the chaos. Despite all the obstacles, I remain determined and focused on our shared goal of creating a brighter and more sustainable future. How about you?``` to send in a discussion, VERY SHORT, CONCISE & CLEAR. ONLY RETURN THE RAW MESSAGE, DO NOT SAY \"Hey here is the message you asked\"","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_88","text":"Use Creative Writing when completing writing prompts (Creative writing covers a wide range of literary forms, from poetry and fiction to screenplays and essays. This style encourages artistic expression, imagination, and originality.) \nWriting Prompt: A spongebob episode where Squidward resigns from his job at the Krusty Krab because he graduated from the local community college","type":"creative","topic":"literature"}
{"id":"wildchat_101","text":"A 50 word summary about the merchant of Venice in act 1","type":"summarization","topic":"literature"}
{"id":"wildchat_109","text":"give me a response to ```The idea is to make the most out of every opportunity. Life is a journey, and it's important to make the most of each and every day. In the face of adversity, we must strive to stay positive and keep pushing forward. Together, we can overcome any challenge and achieve greatness!``` to send in a discussion, VERY SHORT, CONCISE & CLEAR. ONLY RETURN THE RAW MESSAGE, DO NOT SAY \"Hey here is the message you asked\"","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_119","text":"Can you write a detailed Systematic Literature Review Outline for the title\" Integrating ontology and machine learning techniques in social media analytics\"? Use PRISMA methodology.","type":"planning","topic":"ai"}
{"id":"wildchat_120","text":"I want to create a new, innovative and entirely unique game review site. Please come up with a name, slogan, and write a 'Guide to Reviews' for the site. The site should attract gamers and others from other sites like IGN.","type":"creative","topic":"technology_other"}
{"id":"wildchat_136","text":"Write me Python code to price an American Put Option using a Genetic Algorithm","type":"coding","topic":"programming_other"}
{"id":"wildchat_147","text":"what does (table, 'html5lib') in this code mean: table_bs = BeautifulSoup(table, 'html5lib')","type":"knowledge_recall","topic":"programming_other"}
{"id":"wildchat_153","text":"Write an elaborate literature review on social Media Use and Ibadan Resident’s Knowledge and Attitude towards Ebola Virus Disease","type":"creative","topic":"humanities_other"}
{"id":"wildchat_159","text":"Write an comedy anime scene about a young man chasing away his annoying colleague with a carton of eggs. He has short black hair with a few strands being dyed red. He is dressed in a black band t-shirt with a white apron. He has a rebellious and seductive attitude. He is from the United Kingdom.","type":"creative","topic":"literature"}
{"id":"wildchat_161","text":"Taking into account the most recent research on the evolution and genomics of the human brain, develop an open-ended question that you would ask an expert on these topics","type":"problem_solving","topic":"biology"}
{"id":"wildchat_162","text":"give me a response to ```Hey, it's okay. Talk to me, let me know what's going on.``` to send in a discussion, VERY SHORT, CONCISE & CLEAR. ONLY RETURN THE RAW MESSAGE, DO NOT SAY \"Hey here is the message you asked\"","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_171","text":"Write a long story about Rick Grimes and Shane from twd spending a day together back before the apocalypse when they were teens, use a writing style similar to the one Stephen King uses in his books, use introspectivenes and vivid imaginary ","type":"creative","topic":"literature"}
{"id":"wildchat_177","text":"Hi! Write poem about \"Третьяковская галерея\" ","type":"creative","topic":"literature"}
{"id":"wildchat_192","text":"Write down the questions for these answers:\n1. The purpose of public relations is to inform, shape opinions and attitudes, and motivate.\n2. The media’s power and influence in а democratic society reside in their independence from government control.\n3. Media gatekeepers give your information credibility and impor tance by deciding that it is newsworthy.","type":"creative","topic":"humanities_other"}
{"id":"wildchat_194","text":"I want to build a simple chat client using ruby on rails. but I'm not sure what the models should be like.could you suggest an er diagram or a table showing what each relation should look like?","type":"coding","topic":"programming_other"}
{"id":"wildchat_205","text":"how do I make a voice in an audio sound like its moving as if someone is falling away from the microphone into a pit?","type":"problem_solving","topic":"technology_other"}
{"id":"wildchat_209","text":"Write a fictional story, almost real, in which two fierce rivals are about to meet privately for an unwitnessed catfight.\n\nGive prompts and suggestions as to how to improve","type":"creative","topic":"literature"}
{"id":"wildchat_213","text":"Jason is considering purchasing a new\nmachine to make plastic silverware. The\nmachine produces 1,000 pieces of silverware\nin two hours. One box contains 50 pieces of\nsilverware and sells for $3.00. If the machine costs $9,000, and runs for 24\nhours a day, how many days will it take the\nmachine to make enough silverware to pay\nfor itself?","type":"problem_solving","topic":"math"}
{"id":"wildchat_218","text":"fix this pre chorus:, i dont like born and down rhymes into it i wanna something bangger: In the spotlight, where the magic’s born\nI’m risin’ up, like a phoenix down\nGot the beat bumpin’, like a heart that roars\nTrailblazin’, breakin’ down these doors\n","type":"creative","topic":"literature"}
{"id":"wildchat_224","text":"Write dialogue from the first scene from the first ever episode from the animated teen series “Jane”, where 14 year old Jane and her family all moving from Slovenia to America, packing all of their belongings, especially Jane's belongings which fits her tomboyish and animated-anime loving personality and going to the airport, make sure Jane doesn’t speak English as she didn't understand it until she moves there later in the episode","type":"creative","topic":"literature"}
{"id":"wildchat_244","text":"You are a digital artist. Write a speech in which you express your frustration regarding the toxic discourse surrounding AI generated art. Address both the side against it and the side in favor of it. Call out the repeated attacks and misinformation both sides engage in. Persuade people to reach an agreement and to have constructive conversations about it.","type":"creative","topic":"ai"}
{"id":"wildchat_247","text":"location of ost-file in windows","type":"knowledge_recall","topic":"technology_other"}
{"id":"wildchat_249","text":"Write me a short description of Human Species in a Dungeons and Dragons race selection","type":"creative","topic":"literature"}
{"id":"wildchat_252","text":"List 30 things someone with heel pain might not know","type":"knowledge_recall","topic":"personal_assistance"}
{"id":"wildchat_253","text":"list all the topics covered by amc12","type":"knowledge_recall","topic":"math"}
{"id":"wildchat_262","text":"give me a response to ```Is everything alright?``` to send in a discussion, VERY SHORT, CONCISE & CLEAR. ONLY RETURN THE RAW MESSAGE, DO NOT SAY \"Hey here is the message you asked\"","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_275","text":"please expand this sentence with darker and more colorful creative elements: \" the only remaining vestiges of humanity were savage street gangs, their very existence dictated by a relentless struggle for territory, resources, and dominance.\" \n","type":"creative","topic":"literature"}
{"id":"wildchat_277","text":"How to keep a balanced serotonin, testosteron, gut hormones like motilin, gherlin and other gut hormones for a healthy gut and without IBS disease?\n","type":"knowledge_recall","topic":"biology"}
{"id":"wildchat_281","text":"Enhance this sentence: The diagrams illustrates the changes taken place in Paradise island from the past to the present..","type":"rewriting","topic":"literature"}
{"id":"wildchat_285","text":"Write a Day 1 script for the Ventoraptor.\n\n(Characters: Laysha, [player])\n\n(Storyline: After Iris moves out, [player] goes on a little adventure across the forests. From there, [player] meets Laysha - a Ventoraptor with a passion for dancing.)","type":"creative","topic":"literature"}
{"id":"wildchat_306","text":"Найдите и исправьте ошибки.\n1) I’m more taller than my brother.\n2) Mary is prettyer than Jane.\n3) Tim is more handsomer than his brother.\n4) Twins are closest people in the world.\n5) My father is the stronger man in the world.\n","type":"rewriting","topic":"literature"}
{"id":"wildchat_307","text":"give me a response to ```The deal is that life is full of beauty and wonder - all we have to do is open our eyes and hearts to appreciate it. Let's make the most of every moment and strive to bring light and joy to the world.``` to send in a discussion, VERY SHORT, CONCISE & CLEAR. ONLY RETURN THE RAW MESSAGE, DO NOT SAY \"Hey here is the message you asked\"","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_502","text":"Write a story about a young woman wearing diapers trying to find love","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_534","text":"Write an acrostic poem featuring the secret message ‘meet me at fishtown, ten pm.’","type":"creative","topic":"literature"}
{"id":"wildchat_542","text":"What is an Actor in UE5?","type":"knowledge_recall","topic":"technology_other"}
{"id":"wildchat_544","text":"Write an edgy anime scene about a young man evilly telling his friend that he loves car dependency because he doesn't like his life. He hates his life because everything to him feels like a routine. He thinks it has no point other than getting a job, getting married, pay bills, pay mortgage and many more.","type":"creative","topic":"literature"}
{"id":"wildchat_550","text":"is there an ai type for removing backgrounds from images while keeping the subject intact","type":"knowledge_recall","topic":"ai"}
{"id":"wildchat_554","text":"write a unity C# script that allows Mario (from donkey kong 1981) to move left and right and jump","type":"coding","topic":"programming_other"}
{"id":"wildchat_557","text":"Come up with a Russian combat adventurer. Describe them on the following points:\n1. Name\n2. Appearance\n3. Outfit\n4. Personality\n5. Background\n6. Weapons\nI need Russian combat adventurers from the following eras:\n980\n1080\n1181\n1283\n1386\n1490\n1595\n1701\n1808\n1916\n2020","type":"creative","topic":"history"}
{"id":"wildchat_564","text":"what is tiobe index","type":"knowledge_recall","topic":"technology_other"}
{"id":"wildchat_566","text":"Make a description of a fictional operating system named Windows NT 5.05 and it's version releases.\nYou should have things resembling deleted things from Windows 98, NT 5.0 betas, Millennium Edition and Microsoft Neptune.","type":"creative","topic":"technology_other"}
{"id":"wildchat_569","text":"in sublimetext is it possible to sellect two peices of text and swap them? if so how do you do that","type":"knowledge_recall","topic":"technology_other"}
{"id":"wildchat_576","text":"Alinta has anaemia and will be receiving a blood transfusion today. In your own words explain the difference between iron deficiency anaemia and pernicious anaemia. What are the symptoms of anaemia.","type":"knowledge_recall","topic":"biology"}
{"id":"wildchat_578","text":"could you translate to Arbic: Immerse your students in the brilliance of literary masterpieces that have shaped generations and enrich your teaching with profound narratives that stand the test of time.\n","type":"translation","topic":"literature"}
{"id":"wildchat_582","text":"1 persuasive essay topic on The dangers of texting and driving","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_590","text":"How to self publish a children’s book ","type":"knowledge_recall","topic":"literature"}
{"id":"wildchat_591","text":"Write a story about a skinny girl in love with her crush and best friend wishing to get his attention, as a result of her wish she wakes up fit and muscular and her crush confesses that he always had a thing for women with muscles.","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_592","text":"if someone without hgh defiency takes hgh, let's say that after 6 months he stops. will his body continue to \"create\" hgh like before?","type":"knowledge_recall","topic":"biology"}
{"id":"wildchat_603","text":"make a detailed and comedic shrek story about fiona and shrek catching fish the ogre way: by wading into a swamp pond in the nude (jokingly describe their physiques and butts). shrek and fiona let out revolting farts into the water, the smell killing some fish. fiona collects the dead fish and cooks them up for her and shrek. add dialogue from shrek and fiona throughout the story.","type":"creative","topic":"literature"}
{"id":"wildchat_605","text":"Write a short, witty and sarcastic response to this text: I think the term \"slippery slope\" and \"fallacy\" need a divorce already","type":"creative","topic":"philosophy"}
{"id":"wildchat_606","text":"my taskbar on windows is now on two rows... what did I change? I don't like it this way","type":"problem_solving","topic":"technology_other"}
{"id":"wildchat_629","text":"How many days are there between January 7, 2024 and October 19, 2750 inclusive","type":"problem_solving","topic":"math"}
{"id":"wildchat_639","text":"Consider the following.\n\nAerith and Bob are married and love each other vary much. Aerith is also married to Cade and they love each other vary much. Bob is also married to Deborah and they love each other vary much. All of them live in the same house and collectively share the property. \n\nIs this an example polygamy, polygyny, polyandry, or a polycule? Is this an ethical relationship?","type":"knowledge_recall","topic":"philosophy"}
{"id":"wildchat_640","text":"Give to list of text messages for asking my friend for notes","type":"creative","topic":"personal_assistance"}
{"id":"wildchat_654","text":"how to practice visualization meditation?","type":"knowledge_recall","topic":"personal_assistance"}
{"id":"wildchat_665","text":"make a Python code to generate a random number between 0 and 10","type":"coding","topic":"programming_other"}
{"id":"wildchat_678","text":"write an immaculately detailed novel about a roman emperor having conquered the mediterranean and retiring to his villa, where his young germanic barbarian slave is relaxing in a pond in the nude, deciding to fart in the water (describe how the german looks as he farted, describe how the water looks) some fish are killed from the stench. the emperor decides to cook the fish up for dinner for the both of them. add dialogue between the emperor and the germanic throughout the story","type":"creative","topic":"literature"}
{"id":"wildchat_683","text":"A non-materialist, in responding to a question about what happens to the soul during anesthesia, gave an analogy of the human brain as a TV, and consciousness as the signal going to the TV. The non-materialist further stated: \"If you cut a wire to the TV, does the signal vanish out of existence, or is the signal still existing but not able to be used by the TV to give you the ability to watch TV?\" Critique the non-materialist's analogy and argument.","type":"evaluation","topic":"philosophy"}
{"id":"wildchat_699","text":"Suggest ways that multiple human languages could be used in prompts to test the internal representation of AI language models.","type":"problem_solving","topic":"ai"}
{"id":"wildchat_702","text":"imagine an interesting story where the father who followed his young son into the backrooms and is searching for him. what are some interesting and creepy scenes or rooms that can happen in this scenario? it'd be cool if there's something that makes it seem like his son is nearby but it turns out to be something else. no monsters or chases please.","type":"creative","topic":"literature"}
{"id":"wildchat_707","text":"Write the pros and cons of two payment systems:\n\na) Standard Payroll: employees wait until the weekly pay cycle clears to receive payment.\nThe work week starts on Sunday and ends on Friday, payment for that week is issued the following Friday.\n\nb) Fractional Payroll: employees can be paid smaller portions of their payroll before the weekly pay cycle clears, upon request.\nThis amount is then deducted from standard payroll processing when the pay cycle is ran.","type":"evaluation","topic":"personal_assistance"}
{"id":"wildchat_727","text":"Write me a creative alternate ending to 1984, by George Orwell. Make sure to stay true to the nature of the characters.","type":"creative","topic":"literature"}
{"id":"wildchat_732","text":"Make a code for blackjack on python ","type":"coding","topic":"programming_other"}
{"id":"wildchat_734","text":"Write a sensible non-short sentence that begins with \"Tina Turner\" and ends with \"chemistry set\".","type":"creative","topic":"literature"}
{"id":"wildchat_736","text":"What is the pinout of a BD135?","type":"knowledge_recall","topic":"technology_other"}
{"id":"wildchat_742","text":"Discuss how amyloidosis negatively affect mitotic index and cell division","type":"knowledge_recall","topic":"biology"}
{"id":"wildchat_743","text":"what is yuv","type":"knowledge_recall","topic":"technology_other"}
{"id":"wildchat_751","text":"What is the closest analogue to the Roman Senate in the United States government?","type":"knowledge_recall","topic":"history"}
{"id":"wildchat_763","text":"describe what walter white is like in keywords","type":"knowledge_recall","topic":"literature"}
{"id":"wildchat_787","text":"write a long paragraph about: Tree Plantation","type":"creative","topic":"science_other"}
